GT1/turbulent_wedge/turbulent_wedge_kO/turbulent_wedge_kO_HRN_WF/turbulent_wedge_kO_HRN_WF_high_l/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

//internalField   uniform 1e-12;
internalField   uniform 0.0001;
//internalField   uniform 0.1;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    top
    {
	//LRN-HRN
        type            epsilonWallFunction;
        value           uniform 1e-12;
        ////value           $internalField;
        ////value           uniform 1;	//10000 - 10 - 1

	//Best for (1)
        //type            fixedValue;
        //value           uniform 1e-12;

//(1) OK for LaunderSharmaKE and LamBremhorstKE
    }

    front
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }

}

// ************************************************************************* //
